features/cassettes/passported_journey_completes_application/When_Provider_accepts_non-passported_DWP_result_continues_then_goes_back_to_change.yml

---
http_interactions:
- request:
    method: post
    uri: https://benefitchecker.stg.legalservices.gov.uk/lsx/lsc-services/benefitChecker?wsdl
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?> <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsdl="https://lsc.gov.uk/benefitchecker/service/1.0/API_1.0_Check"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"> <env:Body> <wsdl:check>
        <wsdl:clientReference>0d1ba52e-e07c-46ac-832c-2ce274265aef</wsdl:clientReference>
        <wsdl:nino>JA123456A</wsdl:nino> <wsdl:surname>TEST</wsdl:surname> <wsdl:dateOfBirth>19700101</wsdl:dateOfBirth>
        <wsdl:dateOfAward>20250612</wsdl:dateOfAward> <wsdl:lscServiceName><BC_LSC_SERVICE_NAME></wsdl:lscServiceName>
        <wsdl:clientOrgId><BC_CLIENT_ORG_ID></wsdl:clientOrgId> <wsdl:clientUserId><BC_CLIENT_USER_ID></wsdl:clientUserId>
        </wsdl:check> </env:Body> </env:Envelope>
    headers:
      Soapaction:
      - "#POST"
      Content-type:
      - text/xml
      User-Agent:
      - Faraday v2.13.1
  response:
    status:
      code: 200
      message: ''
    headers:
      date:
      - Thu, 12 Jun 2025 11:48:10 GMT
      content-type:
      - text/xml;charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - keep-alive
      x-amzn-trace-id:
      - Root=1-684abe7a-0655c06d6221d78f37b21096;
      vary:
      - Accept-Encoding
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><benefitCheckerResponse
        xmlns="https://lsc.gov.uk/benefitchecker/service/1.0/API_1.0_Check"><ns1:originalClientRef
        xmlns:ns1="http://lsc.gov.uk/benefitchecker/data/1.0">0d1ba52e-e07c-46ac-832c-2ce274265aef</ns1:originalClientRef><ns2:benefitCheckerStatus
        xmlns:ns2="http://lsc.gov.uk/benefitchecker/data/1.0">Undetermined</ns2:benefitCheckerStatus><ns3:confirmationRef
        xmlns:ns3="http://lsc.gov.uk/benefitchecker/data/1.0">T1749728890141</ns3:confirmationRef></benefitCheckerResponse></soapenv:Body></soapenv:Envelope>
  recorded_at: Thu, 12 Jun 2025 11:48:10 GMT
recorded_with: VCR 6.3.1
